책추천 : 수업을 잘 이해 했을 때
    -- 8개월이내에 읽어보자. 단, 지금 볼 내용은 아닐 수 있다.
    
SQLD
[SQL 전문가 가이드] - 한국데이터 산업진흥원 50,000원
    -- 한 번 보면 다시 안 봐도 되어서 돈주고 사긴 아깝긴 하지만 열심히 하려면 구매도 괜춘
[전문가로 가는 지름길_오라클 실습] - 대림 -> 절판됨
    -- 쌤이 제일 강추
    -- 블로그 구글검색 [책제목] -> 두번째 나오는 거 : 다음블로그 why_i_am
    -- 15장 다음에 실습용 스크립트 있음
    -- 단. 그 당시와 지금의 오라클 버전차이(8 과 11)가 있어서 한글이 2바이트에서 지금은 3바이트로 차이가 나니까 조심
{SQL 자격검정 실전문제] - 한국 산업진흥원 18,000원

[불친절한 SQL 프로그래밍] - DBlan
    -- 사전식 책. 정리는 잘 되어있으나 구매는 비추라심
    

SQLP, DAP : 큰 회사들은 다 아는 자격증. 합격률 10~15%
[관계형 데이터 모델링 프리미엄가이드] - 김기창

대용량 데이터베이스 솔루션/ 조광원 인터파크 -> 어둠의 경로로
[새로쓴 대용량 데이터베이스 솔루션 vol 1] - 이화석/ 엔코아

[오라클 성능 고도화 원리와 해법1,2] - 비투엔


교양
[나는 프로그래머다] - 한빛미디어 : 엄청 오래된 책
