책추천 : 수업을 잘 이해 했을 때
    -- 8개월이내에 읽어보자. 단, 지금 볼 내용은 아닐 수 있다.
    
SQLD
[SQL 전문가 가이드] - 한국데이터 산업진흥원 50,000원
    -- 한 번 보면 다시 안 봐도 되어서 돈주고 사긴 아깝긴 하지만 열심히 하려면 구매도 괜춘
[전문가로 가는 지름길_오라클 실습] - 대림 -> 절판됨
    -- 쌤이 제일 강추
    -- 블로그 구글검색 [책제목] -> 두번째 나오는 거 : 다음블로그 why_i_am
    -- 15장 다음에 실습용 스크립트 있음
    -- 단. 그 당시와 지금의 오라클 버전차이(8 과 11)가 있어서 한글이 2바이트에서 지금은 3바이트로 차이가 나니까 조심
{SQL 자격검정 실전문제] - 한국 산업진흥원 18,000원

[불친절한 SQL 프로그래밍] - DBlan
    -- 사전식 책. 정리는 잘 되어있으나 구매는 비추라심
    

SQLP, DAP : 큰 회사들은 다 아는 자격증. 합격률 10~15%
[관계형 데이터 모델링 프리미엄가이드] - 김기창

대용량 데이터베이스 솔루션/ 조광원 인터파크 -> 어둠의 경로로
[새로쓴 대용량 데이터베이스 솔루션 vol 1] - 이화석/ 엔코아

[오라클 성능 고도화 원리와 해법1,2] - 비투엔


교양
[나는 프로그래머다] - 한빛미디어 : 엄청 오래된 책


각각 게시판 작성           JSP/Servlet                 Spring

si/sm 업무의 베이스는                      SQL 
데이터

언제까지 시키는 것만                     Modeling
할텐가                   (SQL이 돌아갈 수 있는 테이블을 만드는 것)

스스로의 길을                 관심사항 : 나만의 주특기를 살려라
찾으세요(도망가!)


실제 업무하다보면 자바코드는 바뀌는게 없다
바뀌는건 거의다 SQL -> 다른 사람이 5시간 걸리는 것을 나는 5분에 하고 싶다면 SQL 공부!

사기업쪽 요즘 대세가 자바스크립트로 UI프레임워크...?


===============================================================================================

3주간 수업
그동안 수업의 목표 : 설계도를 보고 주어진 조건을 만족하는 SQL 을 작성할 수 있다.
SQL 도 언어, JAVA 도 언어
나중에 SQL은 자바를 이용해 콜(호출)한다.
SQL 은 DBMS와 통신 할 수 있는 유일한 수단

연산자
기본연산자로서 덧셈(+) 뺄셈(-) 곱셈(*) 나눗셈(/)을 활용할수 있는데요. 
숫자 데이터는 모두 활용이 가능하나 
-- 날짜데이터는 + - 밖에 사용을 할 수가 없다

NULL을 포함한 연산은 항상 NULL이다.

알리아스 : 별칭에 공백 또는 대소문자 가리는 경우(소문자로 하고 싶을때)
-> "" 더블 코테이션

문자열 결합 : || , CONCAT

DESC 디스크라이브

다르다는 뜻의 연산자 != , <>

WHERE 절 : 조건; 행을 제한하고 싶을때
-> 엑셀의 필터와 동일한 개념

LIKE -> % : 여러문자열 ,  _ : 하나의 문자

OR : 자바는 || , SQL 은 말 그대로 OR

JOIN은 컬럼을 확장
집합연산은 행을 확장

서브쿼리 -> 논리적인 표현을 좀 더 자유롭게 

페어와이즈, 논 페어와이즈 순서쌍

논이퀴조인 : 범위 조인




































